Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/overview--openlayers_overview.tmx
Source language: en
Languages: ja

source: A high-performance, feature-packed library for all your mapping needs
ja: すべてのマッピングのニーズを満たす、ハイパフォーマンス、多機能なライブラリ

source: OpenLayers makes it easy to put a dynamic map in any web page. It can display map tiles, vector data and markers loaded from any source. OpenLayers has been developed to further the use of geographic information of all kinds. It is completely free, Open Source JavaScript, released under the 2-clause BSD License (also known as the FreeBSD).
ja: OpenLayers はいかなる Web ページにおいても、動的な地図を容易に配置できます。いかなるソースからも地図タイル、ベクタデータやマーカーをロードして表示可能です。OpenLayers はすべての種類の地理情報のさらなる利用のために開発されてきました。完全にフリーなオープンソース JavaScript で、2条項 BSD ライセンス (FreeBSD ライセンスとしても知られています) でリリースされています。

source: Core Features
ja: 主な機能

source: Layers
ja: レイヤ

source: Raster: WMS/WMTS, OpenStreetMap, Stamen, Bing, other XYZ sources, static images, etc.
ja: ラスタ: WMS/WMTS, OpenStreetMap, Stamen, Bing, その他 XYZ ソース, 静的画像など

source: Vector: WFS, KML, GeoJSON, TopoJSON, GPX, GML, and MapBox vector tiles.
ja: ベクタ: WFS, KML, GeoJSON, TopoJSON, GPX, GML, MapBox ベクトルタイル

source: Heatmaps.
ja: ヒートマップ

source: Render vector layers as raster.
ja: ベクタレイヤをラスタとして描画

source: Controls and Interactions
ja: コントロールとインタラクション

source: Overview map, zoom slider, zoom in/out buttons, scale line, rotate map, etc.
ja: 地図オーバービュー、ズームスライダー、ズームイン/アウト ボタン、縮尺バー、回転など

source: Map pan, zoom and rotation, feature selection, modification, etc.
ja: 地図の移動、ズームと回転、地物の選択、編集など

source: Styling and customization
ja: スタイリングとカスタマイズ

source: Powerful styling of features: points, lines, polygons and icons.
ja: 強力な地物のスタイリング機能: ポイント、ライン、ポリゴンとアイコン

source: Customize controls look and feel using CSS.
ja: CSS3 を利用したコントロールのルック&フィールのカスタマイズ

source: Overlays
ja: オーバーレイ

source: Render any DOM element at any place on the map.
ja: 地図上の任意の位置への任意の DOM 要素描画

source: Great flexibility to create tooltips and markers.
ja: ツールチップとマーカー作成の高柔軟性

source: Mix the power of HTML5 capabilities with a mapping application.
ja: HTML5 の能力を地図アプリケーションに混合

source: Events
ja: イベント

source: Attach listener functions to map events.
ja: リスナー関数を地図イベントに対する反応としてアタッチ

source: Create your custom controls or interactions.
ja: カスタムコントロールやインタラクションの作成

source: Miscellaneous
ja: その他

source: Mobile browser support.
ja: モバイルブラウザ対応

source: Raster reprojection.
ja: ラスタ再投影

source: Light-weight library. Build customized packages to reduce size.
ja: 軽量ライブラリ。サイズを減らすため、カスタマイズパッケージとしてビルド

source: Render maps using different technologies: Canvas, WebGL.
ja: 地図を異なる技術で描画: Canvas、WebGL

source: Raster analysis (change hue/saturation).
ja: ラスタ解析 (色調/彩度の変更)

source: Details
ja: 詳細

source: **Website:** https://openlayers.org/
ja: **Webサイト:** https://openlayers.org/

source: **License:** 2-clause BSD License (aka FreeBSD License)
ja: **ライセンス:** 2-clause BSD License (FreeBSD License として知られています)

source: **Software Version:** |version-openlayers|
ja: **ソフトウェアバージョン:** |version-openlayers|

source: **API Interface:** JavaScript
ja: **API インターフェイス:** JavaScript

source: **Support:** https://stackoverflow.com/questions/tagged/openlayers (user) and https://groups.google.com/forum/#!forum/openlayers-dev (developer)
ja: **サポート:** https://stackoverflow.com/questions/tagged/openlayers (ユーザ向け) 及び https://groups.google.com/forum/#!forum/openlayers-dev (開発者向け)

source: Quickstart
ja: クイックスタート

source: :doc:`Quickstart documentation <../quickstart/openlayers_quickstart>`
ja: :doc:`クイックスタート文書 <../quickstart/openlayers_quickstart>`
